/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalpha.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mapires- <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/09/13 23:21:28 by mapires-          #+#    #+#             */
/*   Updated: 2022/09/14 00:14:43 by mapires-         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include "libft.h"

int	ft_isalpha(int c)
{
	return ((c >= 65 && c <= 90) || (c >= 97 && c <= 122));
}

/*int main(void)
{
	int c = 122;
	printf("El bueno: %i %i\n", c, isalpha(c));
	printf("El mío: %i %i\n", c, ft_isalpha(c));
	return (0);
}*/
